In [2]:
import pandas as pd
import numpy as np

In [5]:
labels=['a','b','c']
my_data=[10,20,30]
arr=np.array(my_data)
d={'a':10,'b':20,'c':30}

In [10]:
my_data

[10, 20, 30]

In [11]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [12]:
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [14]:
pd.Series(arr)

a    10
b    20
c    30
dtype: int64

In [15]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [18]:
pd.Series(data=[sum, print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [19]:
ser1=pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])

ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [20]:
ser2=pd.Series([1,2,5,4],['USA','Germany','Italy','Japan'])
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [21]:
ser1['USA']

1

In [22]:
ser3=pd.Series(data=labels)
ser3

0    a
1    b
2    c
dtype: object

In [23]:
ser3[1]

'b'

In [24]:
ser1+ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [25]:
#Dataframes

from numpy.random import randn

np.random.seed(10)

In [29]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
#Dataframe signature  Data , Index, Column

df

          W         X         Y         Z
A  0.660232 -0.350872 -0.939433 -0.489337
B -0.804591 -0.212698 -0.339140  0.312170
C  0.565153 -0.147420 -0.025905  0.289094
D -0.539879  0.708160  0.842225  0.203581
E  2.394704  0.917459 -0.112272 -0.362180

In [31]:
df['W']


#Columns are series

A    0.660232
B   -0.804591
C    0.565153
D   -0.539879
E    2.394704
Name: W, dtype: float64

In [32]:
type(df['W'])

pandas.core.series.Series

In [34]:
type(df)

pandas.core.frame.DataFrame

In [42]:
(df[['W','Z']])

          W         Z
A  0.660232 -0.489337
B -0.804591  0.312170
C  0.565153  0.289094
D -0.539879  0.203581
E  2.394704 -0.362180

In [43]:
df['new']=df['W']+df['Y']

In [44]:
df

          W         X         Y         Z       new
A  0.660232 -0.350872 -0.939433 -0.489337 -0.279202
B -0.804591 -0.212698 -0.339140  0.312170 -1.143731
C  0.565153 -0.147420 -0.025905  0.289094  0.539247
D -0.539879  0.708160  0.842225  0.203581  0.302346
E  2.394704  0.917459 -0.112272 -0.362180  2.282431

In [48]:
df.drop('new',axis=1,inplace=True)

In [52]:
df.drop('E', axis=0, inplace=True)

In [53]:
df

          W         X         Y         Z
A  0.660232 -0.350872 -0.939433 -0.489337
B -0.804591 -0.212698 -0.339140  0.312170
C  0.565153 -0.147420 -0.025905  0.289094
D -0.539879  0.708160  0.842225  0.203581

In [55]:
df.shape

(4, 4)

In [56]:
df[['Z','X']]

          Z         X
A -0.489337 -0.350872
B  0.312170 -0.212698
C  0.289094 -0.147420
D  0.203581  0.708160

In [60]:
#selecting rows

df.loc['D']

W   -0.539879
X    0.708160
Y    0.842225
Z    0.203581
Name: D, dtype: float64

In [63]:
#USING numerical based index
df.iloc[2]

W    0.565153
X   -0.147420
Y   -0.025905
Z    0.289094
Name: C, dtype: float64

In [64]:
df.loc['B','Y']

-0.3391402460634347

In [65]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.660232 -0.939433
B -0.804591 -0.339140

In [66]:
#conditional selection

df

          W         X         Y         Z
A  0.660232 -0.350872 -0.939433 -0.489337
B -0.804591 -0.212698 -0.339140  0.312170
C  0.565153 -0.147420 -0.025905  0.289094
D -0.539879  0.708160  0.842225  0.203581

In [67]:
df2=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

df2

          W         X         Y         Z
A -0.232182 -0.501729  1.128785 -0.697810
B -0.081122 -0.529296  1.046183 -1.418556
C -0.362499 -0.121906  0.319356  0.460903
D -0.215790  0.989072  0.314754  2.467651
E -1.508321  0.620601 -1.045133 -0.798009

In [73]:
booldf=df2>0

booldf

       W      X      Y      Z
A  False  False   True  False
B  False  False   True  False
C  False  False   True   True
D  False   True   True   True
E  False   True  False  False

In [74]:
df[booldf]

    W        X         Y         Z
A NaN      NaN -0.939433       NaN
B NaN      NaN -0.339140       NaN
C NaN      NaN -0.025905  0.289094
D NaN  0.70816  0.842225  0.203581

In [76]:
df2['W']>0

A    False
B    False
C    False
D    False
E    False
Name: W, dtype: bool

In [78]:
df2[df2['X']>0]

          W         X         Y         Z
D -0.215790  0.989072  0.314754  2.467651
E -1.508321  0.620601 -1.045133 -0.798009

In [80]:
df[df['Z']>0][['Y','X']]

          Y         X
B -0.339140 -0.212698
C -0.025905 -0.147420
D  0.842225  0.708160

In [85]:

#AND confuses python to think its confusing boolean values
#Use &, |:OR

df2[(df2['X']>0) & (df['Y']>0.5)]

         W         X         Y         Z
D -0.21579  0.989072  0.314754  2.467651

In [86]:
df2

          W         X         Y         Z
A -0.232182 -0.501729  1.128785 -0.697810
B -0.081122 -0.529296  1.046183 -1.418556
C -0.362499 -0.121906  0.319356  0.460903
D -0.215790  0.989072  0.314754  2.467651
E -1.508321  0.620601 -1.045133 -0.798009

In [87]:
df2.reset_index()
#To rest the index to numerical value

  index         W         X         Y         Z
0     A -0.232182 -0.501729  1.128785 -0.697810
1     B -0.081122 -0.529296  1.046183 -1.418556
2     C -0.362499 -0.121906  0.319356  0.460903
3     D -0.215790  0.989072  0.314754  2.467651
4     E -1.508321  0.620601 -1.045133 -0.798009

In [88]:
df2

          W         X         Y         Z
A -0.232182 -0.501729  1.128785 -0.697810
B -0.081122 -0.529296  1.046183 -1.418556
C -0.362499 -0.121906  0.319356  0.460903
D -0.215790  0.989072  0.314754  2.467651
E -1.508321  0.620601 -1.045133 -0.798009

In [89]:
newind='CA NY TX MI'.split()

In [91]:
type(newind)

list

In [92]:
df['States']=newind

In [93]:
df

          W         X         Y         Z States
A  0.660232 -0.350872 -0.939433 -0.489337     CA
B -0.804591 -0.212698 -0.339140  0.312170     NY
C  0.565153 -0.147420 -0.025905  0.289094     TX
D -0.539879  0.708160  0.842225  0.203581     MI

In [ ]:
#set index to the new column

#WARNING- it will reset the index